/** @file
  Strings for Nvme Information DXE

;******************************************************************************
;* Copyright (c) 2021 - 2024, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                         #language en-US " "

#string STR_NVME_INFO_FORMSET                                    #language en-US "NVM Express Information"
#string STR_NVME_INFO_FORMSET_HELP                               #language en-US "NVM Express Information"

#string STR_NVME_DEVICE_FORMSET                                  #language en-US "NVMe Device Information"
#string STR_NVME_DEVICE_FORMSET_HELP                             #language en-US "NVMe Device Information"

#string STR_NO_DEVICE                                            #language en-US "No Device"

#string STR_PORT_NO_DEVICE_FORMAT                                #language en-US "%s: No Device"

#string STR_NVME_DEVICE_FORM                                     #language en-US "NVMe Device Information"
#string STR_NVME_DEVICE_FORM_HELP                                #language en-US "NVMe Device Information"

//
// Controller Information
//
#string STR_NVME_CONTROLLER_INFORMATION                          #language en-US "Controller Information"

#string STR_EFI_DEVICE_PATH                                      #language en-US "EFI Device Path"
#string STR_EFI_DEVICE_PATH_VALUE                                #language en-US ""

#string STR_NVME_PCI_LOCATION_PROMPT                             #language en-US "PCI Location"
#string STR_NVME_PCI_LOCATION_HELP_FORMAT_FULL                   #language en-US "The PCI location of the NVMe controller.\n"
                                                                                 "Segment %u Bus %u Device %u Function %u\n"
                                                                                 "(Hexadecimal: %s)"
#string STR_NVME_PCI_LOCATION_HELP_FORMAT_NOSEG                  #language en-US "The PCI location of the NVMe controller.\n"
                                                                                 "Bus %u Device %u Function %u\n"
                                                                                 "(Hexadecimal: %s)"
#string STR_NVME_PCI_LOCATION_VALUE                              #language en-US ""
#string STR_NVME_PCI_LOCATION_HELP                               #language en-US ""

#string STR_NVME_TOTAL_NAMESPACE_PROMPT                          #language en-US "Total Namespaces"
#string STR_NVME_TOTAL_NAMESPACE_STRING                          #language en-US " "
#string STR_NVME_TOTAL_NAMESPACE_HELP                            #language en-US "Decimal Number"

#string STR_NVME_SERIAL_NUMBER_PROMPT                            #language en-US "Serial Number"
#string STR_NVME_SERIAL_NUMBER_STRING                            #language en-US ""
#string STR_NVME_SERIAL_NUMBER_HELP                              #language en-US "Serial Number"

#string STR_NVME_PRODUCT_MODEL_NUMBER_PROMPT                     #language en-US "Model Number"
#string STR_NVME_PRODUCT_MODEL_NUMBER_STRING                     #language en-US ""
#string STR_NVME_PRODUCT_MODEL_NUMBER_HELP                       #language en-US "Product Model Number"

#string STR_NVME_FIRMWARE_REVISION_PROMPT                        #language en-US "Firmware Revision"
#string STR_NVME_FIRMWARE_REVISION_STRING                        #language en-US ""
#string STR_NVME_FIRMWARE_REVISION_HELP                          #language en-US "Firmware Revision"

#string STR_NVME_IEEE_OUI_PROMPT                                 #language en-US "IEEE OUI"
#string STR_NVME_IEEE_OUI_STRING                                 #language en-US ""
#string STR_NVME_IEEE_OUI_HELP                                   #language en-US "The Organization Unique Identifier (OUI) for the controller vendor."

//
// Namespace Information
//
#string STR_NVME_NAMESPACE_INFORMATION                           #language en-US "Namespace Information"

#string STR_NVME_NAMESPACE_ID_PROMPT                             #language en-US "Namespace ID"
#string STR_NVME_NAMESPACE_ID_HELP                               #language en-US "Decimal Number"

#string STR_NVME_IEEE_EUI64_PROMPT                               #language en-US "IEEE EUI-64"
#string STR_NVME_IEEE_EUI64_HELP                                 #language en-US "The IEEE Extended Unique Identifier (EUI) assigned to the namespace."

#string STR_NVME_STORAGE_CAP_PROMPT                              #language en-US "Storage Capacity"
#string STR_NVME_STORAGE_CAP_HELP                                #language en-US "Decimal Number"

#string STR_NVME_BLOCK_NUMBER_PROMPT                             #language en-US "Block Number"
#string STR_NVME_BLOCK_NUMBER_HELP                               #language en-US "Decimal Number"

#string STR_NVME_BLOCK_SIZE_PROMPT                               #language en-US "Block Size"
#string STR_NVME_BLOCK_SIZE_HELP                                 #language en-US "Unit in byte / Decimal Number"

//
// SMART / Health Information
//
#string STR_NVME_SMART_HEALTH_INFORMATION                        #language en-US "SMART / Health Information"

#string STR_NVME_SMART_CRITICAL_WARNING                          #language en-US "Critical Warning"
#string STR_NVME_SMART_COMPOSITE_TEMPERATURE                     #language en-US "Composite Temperature"
#string STR_NVME_SMART_AVAILABLE_SPARE                           #language en-US "Available Spare"
#string STR_NVME_SMART_AVAILABLE_SPARE_THRESHOLD                 #language en-US "Available Spare Threshold"
#string STR_NVME_SMART_PERCENTAGE_USED                           #language en-US "Percentage Used"
#string STR_NVME_ENDURANCE_CRITICAL_WARNING                      #language en-US "Endurance Group Critical Warning"
#string STR_NVME_SMART_DATA_READ                                 #language en-US "Data Read"
#string STR_NVME_SMART_DATA_WRITTEN                              #language en-US "Data Written"
#string STR_NVME_SMART_HOST_READ_COMMANDS                        #language en-US "Host Read Commands"
#string STR_NVME_SMART_HOST_WRITE_COMMANDS                       #language en-US "Host Write Commands"
#string STR_NVME_SMART_CONTROLLER_BUSY_TIME                      #language en-US "Controller Busy Time (Minutes)"
#string STR_NVME_SMART_POWER_CYCLES                              #language en-US "Power Cycles"
#string STR_NVME_SMART_POWER_ON_HOURS                            #language en-US "Power On Hours"
#string STR_NVME_SMART_UNSAFE_SHUTDOWNS                          #language en-US "Unsafe Shutdowns"
#string STR_NVME_SMART_MEDIA_AND_DATA_INTEGRITY_ERRORS           #language en-US "Media and Data Integrity Errors"
#string STR_NVME_NUMBER_ERROR_INFORMATION_LOG_ENTRIES            #language en-US "Number of Error Information Log Entries"
#string STR_NVME_SMART_WARNING_COMPOSITE_TEMPERATURE_TIME        #language en-US "Warning Composite Temperature Time (Minutes)"
#string STR_NVME_SMART_CRITICAL_COMPOSITE_TEMPERATURE_TIME       #language en-US "Critical Composite Temperature Time (Minutes)"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_1                      #language en-US "Temperature Sensor 1"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_2                      #language en-US "Temperature Sensor 2"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_3                      #language en-US "Temperature Sensor 3"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_4                      #language en-US "Temperature Sensor 4"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_5                      #language en-US "Temperature Sensor 5"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_6                      #language en-US "Temperature Sensor 6"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_7                      #language en-US "Temperature Sensor 7"
#string STR_NVME_SMART_TEMPERATURE_SENSOR_8                      #language en-US "Temperature Sensor 8"
#string STR_NVME_SMART_TMT1_TRANSITION_COUNT                     #language en-US "Thermal Management Temperature 1 Transition Count"
#string STR_NVME_SMART_TMT2_TRANSITION_COUNT                     #language en-US "Thermal Management Temperature 2 Transition Count"
#string STR_NVME_SMART_TOTAL_TIME_TMT1                           #language en-US "Total Time for Thermal Management Temperature 1 (Seconds)"
#string STR_NVME_SMART_TOTAL_TIME_TMT2                           #language en-US "Total Time for Thermal Management Temperature 2 (Seconds)"

#string STR_NVME_SMART_VALUE_00                                  #language en-US ""
#string STR_NVME_SMART_VALUE_01                                  #language en-US ""
#string STR_NVME_SMART_VALUE_02                                  #language en-US ""
#string STR_NVME_SMART_VALUE_03                                  #language en-US ""
#string STR_NVME_SMART_VALUE_04                                  #language en-US ""
#string STR_NVME_SMART_VALUE_05                                  #language en-US ""
#string STR_NVME_SMART_VALUE_06                                  #language en-US ""
#string STR_NVME_SMART_VALUE_07                                  #language en-US ""
#string STR_NVME_SMART_VALUE_08                                  #language en-US ""
#string STR_NVME_SMART_VALUE_09                                  #language en-US ""
#string STR_NVME_SMART_VALUE_10                                  #language en-US ""
#string STR_NVME_SMART_VALUE_11                                  #language en-US ""
#string STR_NVME_SMART_VALUE_12                                  #language en-US ""
#string STR_NVME_SMART_VALUE_13                                  #language en-US ""
#string STR_NVME_SMART_VALUE_14                                  #language en-US ""
#string STR_NVME_SMART_VALUE_15                                  #language en-US ""
#string STR_NVME_SMART_VALUE_16                                  #language en-US ""
#string STR_NVME_SMART_VALUE_17                                  #language en-US ""
#string STR_NVME_SMART_VALUE_18                                  #language en-US ""
#string STR_NVME_SMART_VALUE_19                                  #language en-US ""
#string STR_NVME_SMART_VALUE_20                                  #language en-US ""
#string STR_NVME_SMART_VALUE_21                                  #language en-US ""
#string STR_NVME_SMART_VALUE_22                                  #language en-US ""
#string STR_NVME_SMART_VALUE_23                                  #language en-US ""
#string STR_NVME_SMART_VALUE_24                                  #language en-US ""
#string STR_NVME_SMART_VALUE_25                                  #language en-US ""
#string STR_NVME_SMART_VALUE_26                                  #language en-US ""
#string STR_NVME_SMART_VALUE_27                                  #language en-US ""
#string STR_NVME_SMART_VALUE_28                                  #language en-US ""
#string STR_NVME_SMART_VALUE_29                                  #language en-US ""

//
// End of file
//